#Условный оператор - оператор, который проверяет условие.
# Т.е. это if, elif и else



#вложенный условный оператор - Это когда один условный оператор
#вложен в другой
#you are too old

# a = int(input())
#
# if a > 18:
#     if a % 2 == 0:
#         print('Это число больше 18 и оно четное')
#     else:
#         print('Это число больше 18 и оно не четное')
#
# else:
#     if a % 2 == 0:
#         print('Это число меньше 18 и оно четное')
#     else:
#         print('Это число меньше 18 и оно не четное')



#Цикл - это повторение каких - либо действий.
#while и for.
#integer - целые числа



#import random

#a = random.randint(1, 46)
#random - случайное
#int - integer - целые числа
#print(a)



print(len('Бокс, дзюдо, футбол, бейсбол, плавание, бадминтон, фехтование – виды спорта'))